In [3]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass

In [6]:
#### REMEMBER TO CHANGE THE PASSW BEFORE GITHUB
password = getpass.getpass()

········

In [8]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'

engine = create_engine(connection_string)

data = pd.read_sql_query('SELECT * FROM actor', engine)
data.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

## 1. How many distinct (different) actors' last names are there?

In [10]:
data = pd.read_sql_query('SELECT COUNT(DISTINCT last_name) FROM sakila.actor', engine)
data

   COUNT(DISTINCT last_name)
0                        121

## 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [16]:
query = 'SELECT *, WEEKDAY(rental_date) AS "Weekday", CASE WHEN (WEEKDAY(rental_date) >  4 ) then "weekend" ELSE "workday" END AS day_type \
FROM sakila.rental'
data1 = pd.read_sql_query(query, engine)
data1.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,Weekday,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,1,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,1,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,1,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,1,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,1,workday

## 3. Get all films with ARMAGEDDON in the title.

In [18]:
query = 'SELECT title \
FROM sakila.film \
WHERE title LIKE "%ARMAGEDDON%"'

data2 = pd.read_sql_query(query, engine)
data2.head()

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

## 4. Get 10 the longest films.

In [20]:
query = 'SELECT DISTINCT length, title \
FROM sakila.film \
ORDER BY length DESC \
LIMIT 10'

data3 = pd.read_sql_query(query, engine)
data3.head(10)

   length               title
0     185       CHICAGO NORTH
1     185      CONTROL ANTHEM
2     185      DARN FORRESTER
3     185         GANGS PRIDE
4     185           HOME PITY
5     185       MUSCLE BRIGHT
6     185        POND SEATTLE
7     185  SOLDIERS EVOLUTION
8     185   SWEET BROTHERHOOD
9     185        WORST BANGER

## 5. How many films include Behind the Scenes content?

In [21]:
query = '''SELECT COUNT(film_id)
FROM sakila.film
WHERE special_features LIKE '%Behind_the_Scenes%';'''

data4 = pd.read_sql_query(query, engine)
data4.head()

   COUNT(film_id)
0             538

## 6. Which kind of movies (rating) have a mean duration of more than two hours?

In [22]:
query = '''SELECT AVG(length), rating
FROM sakila.film
GROUP BY rating
HAVING AVG(length)>120;'''

data5 = pd.read_sql_query(query, engine)
data5.head()

   AVG(length) rating
0     120.4439  PG-13

## 7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [23]:
query = '''SELECT title, length, rental_rate
FROM sakila.film
WHERE (length <> '0')
ORDER BY length;'''

data6 = pd.read_sql_query(query, engine)
data6.head()

                 title  length  rental_rate
0         ALIEN CENTER      46         2.99
1            IRON MOON      46         4.99
2        KWAI HOMEWARD      46         0.99
3     LABYRINTH LEAGUE      46         2.99
4  RIDGEMONT SUBMARINE      46         0.99